Revit 2027 API
GBXMLExportOptions Constructor
 Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GBXMLExportOptions()
Public Sub New
public:
GBXMLExportOptions()
new : unit -> GBXMLExportOptions
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace